Revit 2027 API
BasicFileInfo.GetDocumentVersion Method
 Gets the DocumentVersion for the file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DocumentVersion GetDocumentVersion()
Public Function GetDocumentVersion As DocumentVersion
public:
DocumentVersion^ GetDocumentVersion()
member GetDocumentVersion : unit -> DocumentVersion
Return Value
DocumentVersion
 The DocumentVersion for the file.
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace